connector/http/src/test/resources/ifx20_partyInq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <fnis:PartyInqRq xmlns="urn:ifxforum-org:XSD:1" xmlns:fnis="http://www.fnf.com/xes">
         <RqUID>0b5bcd23-fede-447c-8b40-b0cd2a6d597b</RqUID>
         <MsgRqHdr>
            <CredentialsRqHdr>
               <SubjectRole>System</SubjectRole>
               <SecTokenLogin>
                  <LoginName>samm</LoginName>
                  <SubjectPswd>
                     <CryptType>none</CryptType>
                     <Pswd>samm</Pswd>
                  </SubjectPswd>
               </SecTokenLogin>
            </CredentialsRqHdr>
            <ContextRqHdr>
               <ClientDt>0000-00-00T00:00:00.000000-00:00</ClientDt>
               <CustLangPref>en_US</CustLangPref>
               <ClientApp>
                  <Org>Atom</Org>
                  <Name>Atom Bank</Name>
                  <Version>1</Version>
               </ClientApp>
               <SPName>com.fnis.xes.PRF</SPName>
            </ContextRqHdr>
         </MsgRqHdr>
         <fnis:PartySel>
            <PartyKeys>
               <PartyIdent>
                  <PartyIdentValue>14</PartyIdentValue>
               </PartyIdent>
            </PartyKeys>
         </fnis:PartySel>
      </fnis:PartyInqRq>
   </soapenv:Body>
</soapenv:Envelope>